In [1]:
import pandas as pd

In [4]:
#importamos el dataset y lo guardamos en dataframe
dataframe = pd.read_csv('personas.csv')

In [5]:
#vemos los primeros cinco elementos
dataframe.head()

    NOMBRE          APELLIDOS  EDAD  SALARIO
0  ANTONIO        PEREZ GOMEZ    34    20000
1     LUIS  RODRIGUEZ VAZQUEZ    45    45000
2     ROSA     MARTINEZ LOPEZ    25    15000
3    PEDRO     SILVA GONZALEZ    54    50000
4    MARIA         DIAZ LOPEZ    40    32000

In [6]:
dataframe.describe()

            EDAD       SALARIO
count   5.000000      5.000000
mean   39.600000  32400.000000
std    10.968136  15208.550227
min    25.000000  15000.000000
25%    34.000000  20000.000000
50%    40.000000  32000.000000
75%    45.000000  45000.000000
max    54.000000  50000.000000

In [8]:
#podemos capturar una columna de esta manera
dataframe['NOMBRE']

0    ANTONIO
1       LUIS
2       ROSA
3      PEDRO
4      MARIA
Name: NOMBRE, dtype: object

In [9]:
#podemos capturar un determinado elemento de la columna de esta manera
dataframe['NOMBRE'][0]

'ANTONIO'

In [12]:
#para seleccionar dos columnas
dataframe[['NOMBRE','APELLIDOS']] #Como son dos columnas se lo 'pasa' como una lista, por eso es necesario corchetes

    NOMBRE          APELLIDOS
0  ANTONIO        PEREZ GOMEZ
1     LUIS  RODRIGUEZ VAZQUEZ
2     ROSA     MARTINEZ LOPEZ
3    PEDRO     SILVA GONZALEZ
4    MARIA         DIAZ LOPEZ

In [15]:
#Para saber quienes tienen un salario superior a 30000
dataframe['SALARIO'] > 30000

0    False
1     True
2    False
3     True
4     True
Name: SALARIO, dtype: bool

In [16]:
#podemos crear un filtro
filtro = dataframe['SALARIO']> 30000

In [19]:
#usamos el filtro para crear otro dataframe
dataframe2 = dataframe[filtro]
dataframe2

  NOMBRE          APELLIDOS  EDAD  SALARIO
1   LUIS  RODRIGUEZ VAZQUEZ    45    45000
3  PEDRO     SILVA GONZALEZ    54    50000
4  MARIA         DIAZ LOPEZ    40    32000

In [21]:
#creamos un array a partir de los valores del dataframe
array = dataframe2.values

In [22]:
array

array([['LUIS', 'RODRIGUEZ VAZQUEZ', 45, 45000],
       ['PEDRO', 'SILVA GONZALEZ', 54, 50000],
       ['MARIA', 'DIAZ LOPEZ', 40, 32000]], dtype=object)

In [25]:
#comprobamos que nuestro array es una matriz
array.shape

(3, 4)

In [27]:
array[1][1]

'SILVA GONZALEZ'